In [113]:
import pandas as pd
import numpy as np

In [114]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

#### 1. Some values in the the FlightNumber column are missing. These numbers are
####  meant to increase by 10 with each row so 10055 and 10075 need to be put in
####  place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [115]:
flightNum = df.FlightNumber

In [116]:

for count,num in enumerate(flightNum):
    
    if(np.isnan(num) == True):
        previousnum = flightNum[count-1]
        flightNum[count] = previousnum+10
       
         
df['FlightNumber'] = pd.Series(flightNum)
df.head()

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

### 2. The From_To column would be better as two separate columns! Split eachstring on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [117]:
dfTemp =pd.DataFrame()

dfTemp[['From_loc','to_loc']] = df.From_To.str.split("_",expand= True)

#### 3, Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [118]:
dfTemp['From_loc']= dfTemp['From_loc'].str.capitalize()
dfTemp['to_loc']= dfTemp['to_loc'].str.capitalize()

In [119]:
dfTemp.head()

   From_loc     to_loc
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

###  4.Delete the From_To column from df and attach the temporary DataFramefrom the previous questions.

In [120]:
df["id"] = df.index + 1
dfTemp["id"] = df.index + 1
df = pd.merge(df, dfTemp,on='id')
df = df.drop(['From_To','id'],axis =1)

#### 5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN. Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [129]:
recentDelays= df['RecentDelays']

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [126]:
maxLenList = 0
for a in recentDelays:
    if len(a) > maxLenList:
        maxLenList= len(a)

In [155]:
for a,num in zip(range(0,maxLenList),recentDelays):
    list1= []
    for listIndex in range(0,df.shape[0]):
        try:
            list1.append(recentDelays[listIndex][a])
        except:
            list1.append(np.nan)
    
    df['delay_'+str(a)] = pd.Series(list1)

In [157]:
df= df.drop(['RecentDelays'],axis =1)

In [158]:
df.head()

,FlightNumber,Airline,From_loc,to_loc,delay_0,delay_1,delay_2
0,10045.0,KLM(!),London,Paris,23.0,47.0,NaN
1,10055.0,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075.0,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"""Swiss Air""",Brussels,London,67.0,32.0,NaN